"""
Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
Ваша задача — вывести дату в текстовом виде,
    например:   второе ноября 2013 года.
                Склонением пренебречь (2000 года, 2010 года)
"""
monthes = ("января", "февраля", "марта", "апреля", "мая", "июня", "июля",
           "августа", "сентября", "октября", "ноября", "декабря")

days = ("Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое",
        "Седьмое", "Восьмое", "Девятое", "Десятое", "Одинадцатое",
        "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое",
        "Шестнадцатое", "Семьнадцатое", "Восемьнадцатое", "Девятнадцатое",
        "Двадцатое")

decades = ("Двадцать", "Тридцать")
date_str = "21.11.2013"

date_list = date_str.split(".")
day_num = int(date_list[0])
month_num = int(date_list[1])
year_num = int(date_list[2])

if day_num <= 20:
    day_str = days[day_num - 1]
elif day_num < 30:
    day_str = "{} {}".format(decades[0], days[day_num - 21].lower())
elif day_num == 30:
    day_str = "Тридатое"
else:
    day_str = "{} {}".format(decades[1], days[day_num - 31].lower())

print("{} {} {} года".format(day_str, monthes[month_num - 1], year_num))
