"""
    Создайте функцию, принимающую на вход 3 числа и
    возвращающую наибольшее из них.
"""


def max_number(a, b, c):    # Правильное решение
    return max([a, b, c])


print(max_number(1, 9, 3))
print(max_number(2, 4, 1))
print(max_number(3, 2, 5))
print(max_number(7, 1, 2))
